<a href="https://colab.research.google.com/github/gakurujnr/ip_week_3/blob/master/Moringa_Data_Science_Prep_W3_Independent_Project_2019_07_Peter_Gakuru_PythonNotebook.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Importing Libraries

In [0]:
#
import pandas as pd
#
import numpy as np

Loading the Database

In [55]:
#Loading a csv file
#
pr = pd.read_csv('cells_geo.csv', delimiter = ';')
pr.head()

   Unnamed: 0   VILLES      STATUS  ... AREA     CELL_ID   SITE_CODE
0           0   ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1           1   ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17
2           2   ADJAME  In Service  ...  NaN  0c2e182a0c  0bb492ef17
3           3  ASSINIE  In Service  ...  NaN  69bdfc69fd  8a1e6ce31f
4           4  ASSINIE  In Service  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 12 columns]

In [56]:
#Loading a csv file
#
pr1 = pd.read_csv('MoringaSchool_CDR7.csv', delimiter= ',')
pr1.head()

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice    0.0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms    0.0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms   25.0  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice   56.0  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice   14.0  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [57]:
#Loading a csv file
#
pr2 = pd.read_csv('MoringaSchool_CDR8.csv', delimiter= ',')
pr2.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 10 columns]

In [58]:
#Loading an excel file
#
pr3 = pd.read_excel('CDR_description.xlsx')
pr3.head()

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String

In [101]:
#Loading an excel file
#
pr4 = pd.read_excel('cells_geo_description.xlsx')
pr4.head()

    Column name        Description  Format
0        VILLES               City  String
1        STATUS  In Service or not  String
2  LOCALISATION  in ABIDJAN or not  String
3    DECOUPZONE  Geographical Zone  String
4      ZONENAME       Name of Zone  String

In [60]:
#Loading a csv file
#
#
pr5 = pd.read_csv('MoringaSchool_CDR9.csv', delimiter= ',')
pr5.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

In [61]:
#Cleaning the data by ensuring names of columns in the three table are similar
#
#
pr1.rename(columns={'PRODUTC': 'PRODUCT'}, inplace=True)
pr1.head()

  PRODUCT  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice    0.0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms    0.0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms   25.0  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice   56.0  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice   14.0  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [62]:
#Cleaning the data by ensuring names of columns in the three table are similar
#
#
pr5.rename(columns={'SIET_ID': 'SITE_ID'}, inplace=True)
pr5.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SITE_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

In [63]:
#Cleaning the data by ensuring names of columns in the three table are similar
#
pr2.rename(columns={'DW_A_NUMBER': 'DW_A_NUMBER_INT', 'DW_B_NUMBER': 'DW_B_NUMBER_INT'}, inplace=True)
pr2.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 10 columns]

In [64]:
#
#checking on the column names if they are the same
pr1.head(0)

Empty DataFrame
Columns: [PRODUCT, VALUE, DATETIME, CELL_ON_SITE, DW_A_NUMBER_INT, DW_B_NUMBER_INT, COUNTRY_A, COUNTRY_B, CELL_ID, SITE_ID]
Index: []

In [65]:
#
#
pr5.head(0)

Empty DataFrame
Columns: [PRODUCT, VALUE, DATE_TIME, CELL_ON_SITE, DW_A_NUMBER_INT, DW_B_NUMBER_INT, COUNTRY_A, COUNTRY_B, CELLID, SITE_ID]
Index: []

In [66]:
#
#
pr2.head(0)

Empty DataFrame
Columns: [PRODUCT, VALUE, DATE_TIME, CELL_ON_SITE, DW_A_NUMBER_INT, DW_B_NUMBER_INT, COUNTRY_A, COUNTRY_B, CELL_ID, SITE_ID]
Index: []

In [67]:
#
#
pr5.rename(columns={'CELLID': 'CELL_ID'}, inplace=True)
pr5.head(1)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx

[1 rows x 10 columns]

In [68]:
#
#
pr1.rename(columns={'DATETIME': 'DATE_TIME'}, inplace=True)
pr1.head(1)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice    0.0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu

[1 rows x 10 columns]

In [69]:
pr1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 360927 entries, 0 to 360926
Data columns (total 10 columns):
PRODUCT            360927 non-null object
VALUE              360926 non-null float64
DATE_TIME          360926 non-null object
CELL_ON_SITE       360926 non-null object
DW_A_NUMBER_INT    360926 non-null object
DW_B_NUMBER_INT    360926 non-null object
COUNTRY_A          360926 non-null object
COUNTRY_B          360926 non-null object
CELL_ID            360926 non-null object
SITE_ID            293554 non-null object
dtypes: float64(1), object(9)
memory usage: 27.5+ MB

In [70]:
pr2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1398788 entries, 0 to 1398787
Data columns (total 10 columns):
PRODUCT            1398788 non-null object
VALUE              1398788 non-null int64
DATE_TIME          1398788 non-null object
CELL_ON_SITE       1398788 non-null object
DW_A_NUMBER_INT    1398788 non-null object
DW_B_NUMBER_INT    1398787 non-null object
COUNTRY_A          1398787 non-null object
COUNTRY_B          1398787 non-null object
CELL_ID            1398787 non-null object
SITE_ID            1313527 non-null object
dtypes: int64(1), object(9)
memory usage: 106.7+ MB

In [71]:
pr5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 414768 entries, 0 to 414767
Data columns (total 10 columns):
PRODUCT            414768 non-null object
VALUE              414768 non-null int64
DATE_TIME          414768 non-null object
CELL_ON_SITE       414768 non-null object
DW_A_NUMBER_INT    414768 non-null object
DW_B_NUMBER_INT    414768 non-null object
COUNTRY_A          414768 non-null object
COUNTRY_B          414768 non-null object
CELL_ID            414768 non-null object
SITE_ID            347331 non-null object
dtypes: int64(1), object(9)
memory usage: 31.6+ MB

In [72]:
##
##Creating DataFrane in each csv files
pr1_1 = pd.DataFrame(pr1)
pr1_1.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice    0.0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms    0.0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms   25.0  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice   56.0  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice   14.0  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [73]:
#
#
#creating dataframe from pr2 csv file
pr2_2 = pd.DataFrame(pr2)
pr2_2.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 10 columns]

In [74]:
#
##
#Creating dataframe for pr5 csv file
pr5_5 = pd.DataFrame(pr5)
pr5_5.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

In [75]:
#Concatinating all the tables together
#
projo = pd.concat([pr1_1, pr2_2, pr5_5])
projo = projo.reset_index(drop=True)
projo.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice    0.0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms    0.0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms   25.0  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice   56.0  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice   14.0  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [76]:
##
#
projo[['DATE', 'TIME']] = projo.DATE_TIME.str.split(expand=True)
projo.head()

  PRODUCT  VALUE              DATE_TIME  ...     SITE_ID        DATE        TIME
0   Voice    0.0  2012-05-06 23:04:37.0  ...  /TJNe+Mmtu  2012-05-06  23:04:37.0
1     sms    0.0  2012-05-06 23:05:25.0  ...  /+cKZKIp41  2012-05-06  23:05:25.0
2     sms   25.0  2012-05-06 23:05:41.0  ...  /u0FSD+ahi  2012-05-06  23:05:41.0
3   Voice   56.0  2012-05-06 23:05:42.0  ...  +cNeJzsTp3  2012-05-06  23:05:42.0
4   Voice   14.0  2012-05-06 23:06:29.0  ...  051KhYDCpv  2012-05-06  23:06:29.0

[5 rows x 12 columns]

In [77]:
#drop DATE_TIME because we have created and separated the DATE and TIME column

del projo['DATE_TIME']
projo.head()

  PRODUCT  VALUE CELL_ON_SITE  ...     SITE_ID        DATE        TIME
0   Voice    0.0            1  ...  /TJNe+Mmtu  2012-05-06  23:04:37.0
1     sms    0.0            0  ...  /+cKZKIp41  2012-05-06  23:05:25.0
2     sms   25.0            0  ...  /u0FSD+ahi  2012-05-06  23:05:41.0
3   Voice   56.0            1  ...  +cNeJzsTp3  2012-05-06  23:05:42.0
4   Voice   14.0            1  ...  051KhYDCpv  2012-05-06  23:06:29.0

[5 rows x 11 columns]

In [78]:
#Delete country_A
del projo['COUNTRY_A']
projo.head()

  PRODUCT  VALUE CELL_ON_SITE  ...     SITE_ID        DATE        TIME
0   Voice    0.0            1  ...  /TJNe+Mmtu  2012-05-06  23:04:37.0
1     sms    0.0            0  ...  /+cKZKIp41  2012-05-06  23:05:25.0
2     sms   25.0            0  ...  /u0FSD+ahi  2012-05-06  23:05:41.0
3   Voice   56.0            1  ...  +cNeJzsTp3  2012-05-06  23:05:42.0
4   Voice   14.0            1  ...  051KhYDCpv  2012-05-06  23:06:29.0

[5 rows x 10 columns]

In [79]:
# Delete country_b
del projo['COUNTRY_B']
projo.head()

  PRODUCT  VALUE CELL_ON_SITE  ...     SITE_ID        DATE        TIME
0   Voice    0.0            1  ...  /TJNe+Mmtu  2012-05-06  23:04:37.0
1     sms    0.0            0  ...  /+cKZKIp41  2012-05-06  23:05:25.0
2     sms   25.0            0  ...  /u0FSD+ahi  2012-05-06  23:05:41.0
3   Voice   56.0            1  ...  +cNeJzsTp3  2012-05-06  23:05:42.0
4   Voice   14.0            1  ...  051KhYDCpv  2012-05-06  23:06:29.0

[5 rows x 9 columns]

In [80]:
#information
#
projo.head(0)

Empty DataFrame
Columns: [PRODUCT, VALUE, CELL_ON_SITE, DW_A_NUMBER_INT, DW_B_NUMBER_INT, CELL_ID, SITE_ID, DATE, TIME]
Index: []

Finding Data and Voice in different DataFrame

In [81]:
#
#I am Grouping the PRODUCT columns
projo.VALUE.groupby(projo["PRODUCT"]).sum()

PRODUCT
Voice    38596456.0
da              0.0
data       760940.0
sms       1949939.0
Name: VALUE, dtype: float64

In [82]:
##
#
projo.columns = map(str.lower, projo.columns)
projo.head()

  product  value cell_on_site  ...     site_id        date        time
0   Voice    0.0            1  ...  /TJNe+Mmtu  2012-05-06  23:04:37.0
1     sms    0.0            0  ...  /+cKZKIp41  2012-05-06  23:05:25.0
2     sms   25.0            0  ...  /u0FSD+ahi  2012-05-06  23:05:41.0
3   Voice   56.0            1  ...  +cNeJzsTp3  2012-05-06  23:05:42.0
4   Voice   14.0            1  ...  051KhYDCpv  2012-05-06  23:06:29.0

[5 rows x 9 columns]

In [83]:
##
# pr.head()
pr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3974 entries, 0 to 3973
Data columns (total 12 columns):
Unnamed: 0      3974 non-null int64
VILLES          3974 non-null object
STATUS          3907 non-null object
LOCALISATION    3974 non-null object
DECOUPZONE      3974 non-null object
ZONENAME        3968 non-null object
LONGITUDE       3974 non-null float64
LATITUDE        3974 non-null float64
REGION          3974 non-null object
AREA            3951 non-null object
CELL_ID         3974 non-null object
SITE_CODE       3974 non-null object
dtypes: float64(2), int64(1), object(9)
memory usage: 372.6+ KB

In [86]:
##
#
pr4.head()

    Column name        Description  Format
0        VILLES               City  String
1        STATUS  In Service or not  String
2  LOCALISATION  in ABIDJAN or not  String
3    DECOUPZONE  Geographical Zone  String
4      ZONENAME       Name of Zone  String

In [1]:
##Cleaning the dataset by checking on the missing values
##
# pr4.isnull().values.any()
pr4["VILLES"].values_counts()
# pr4

NameError: ignored

In [96]:
##Cleaning the dataset by checking on the missing values
#
pr.isnull().values.any()

True

In [97]:
##Iterating through the columns
##
pr.isnull().sum()

Unnamed: 0       0
VILLES           0
STATUS          67
LOCALISATION     0
DECOUPZONE       0
ZONENAME         6
LONGITUDE        0
LATITUDE         0
REGION           0
AREA            23
CELL_ID          0
SITE_CODE        0
dtype: int64

In [98]:
###iterate through the columns
#counting for each column how many null values there are and produce a new dataframe 
#which displays the sum of  isnull values alongside the column header names.
##It has no count
pr4.isnull().sum()

Column name    0
Description    0
Format         0
dtype: int64

In [104]:
##
##

KeyError: ignored